# GROUP BY
* 월별 총 결제수 / 총 결제액 / 평균 결제액 뽑기

In [1]:
import pandas as pd
import MySQLdb

db = MySQLdb.connect(
    'db.fastcamp.us', 
    'root',
    'dkstncks',
    'sakila',
    charset='utf8',
)

In [2]:
SQL_QUERY = """
    SELECT * FROM payment;
"""

payment_df = pd.read_sql(SQL_QUERY, db)

In [3]:
payment_df.tail()

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
16044,16045,599,1,14599,4.99,2005-08-21 17:43:42,2006-02-15 22:24:12
16045,16046,599,1,14719,1.99,2005-08-21 21:41:57,2006-02-15 22:24:12
16046,16047,599,2,15590,8.99,2005-08-23 06:09:44,2006-02-15 22:24:12
16047,16048,599,2,15719,2.99,2005-08-23 11:08:46,2006-02-15 22:24:13
16048,16049,599,2,15725,2.99,2005-08-23 11:25:00,2006-02-15 22:24:13

### SQL

In [13]:
# 항상 FROM table 먼저하고 어떤것을 빼올지 차례차례 적어나가는게 중요
# 만약 average를 구할때도 차례차례구한다음 COUNT와 SUM을 #으로 지워주면 됨

SQL_QUERY = """
    SELECT
        LEFT(payment.payment_date, 7) 'Month',
        COUNT(payment.payment_id) 'Total Payment Count',
        SUM(payment.amount) 'Total Payment Amount',
        SUM(payment.amount) / COUNT(payment.payment_id) 'Amount Per Payment'
    FROM
        payment
    GROUP BY 1
    ORDER BY 1 ASC
    ;
"""

pd.read_sql(SQL_QUERY, db)

     Month  Total Payment Count  Total Payment Amount  Amount Per Payment
0  2005-05                 1157               4824.43            4.169775
1  2005-06                 2312               9631.88            4.166038
2  2005-07                 6711              28373.89            4.227968
3  2005-08                 5687              24072.13            4.232835
4  2006-02                  182                514.18            2.825165

In [10]:
1157 * 4.169775

4824.429674999999

### pandas
* count / sum / average
* aggreate : 집합, 합치다 : 데이터를 합치는 기능

In [15]:
payment_df = pd.read_sql("SELECT * FROM payment;", db)
payment_df.tail()

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
16044,16045,599,1,14599,4.99,2005-08-21 17:43:42,2006-02-15 22:24:12
16045,16046,599,1,14719,1.99,2005-08-21 21:41:57,2006-02-15 22:24:12
16046,16047,599,2,15590,8.99,2005-08-23 06:09:44,2006-02-15 22:24:12
16047,16048,599,2,15719,2.99,2005-08-23 11:08:46,2006-02-15 22:24:13
16048,16049,599,2,15725,2.99,2005-08-23 11:25:00,2006-02-15 22:24:13

In [19]:
payment_df['month'] = payment_df['payment_date'].apply(
    lambda x: str(x)[:7])
payment_df.tail()

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update,month
16044,16045,599,1,14599,4.99,2005-08-21 17:43:42,2006-02-15 22:24:12,2005-08
16045,16046,599,1,14719,1.99,2005-08-21 21:41:57,2006-02-15 22:24:12,2005-08
16046,16047,599,2,15590,8.99,2005-08-23 06:09:44,2006-02-15 22:24:12,2005-08
16047,16048,599,2,15719,2.99,2005-08-23 11:08:46,2006-02-15 22:24:13,2005-08
16048,16049,599,2,15725,2.99,2005-08-23 11:25:00,2006-02-15 22:24:13,2005-08

In [23]:
import numpy as np

In [25]:
payment_df.groupby('month').agg({
        'payment_id' : [np.size,],  # COUNT
        'amount' : [np.sum, np.mean],  # SUM, MEAN   
    })

        payment_id    amount
              size       sum      mean
month
2005-05       1157   4824.43  4.169775
2005-06       2312   9631.88  4.166038
2005-07       6711  28373.89  4.227968
2005-08       5687  24072.13  4.232835
2006-02        182    514.18  2.825165

In [27]:
payment_df = pd.read_sql("SELECT * FROM payment;", db)
payment_df.tail()

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
16044,16045,599,1,14599,4.99,2005-08-21 17:43:42,2006-02-15 22:24:12
16045,16046,599,1,14719,1.99,2005-08-21 21:41:57,2006-02-15 22:24:12
16046,16047,599,2,15590,8.99,2005-08-23 06:09:44,2006-02-15 22:24:12
16047,16048,599,2,15719,2.99,2005-08-23 11:08:46,2006-02-15 22:24:13
16048,16049,599,2,15725,2.99,2005-08-23 11:25:00,2006-02-15 22:24:13

In [30]:
payment_df['month'] = payment_df['payment_date'].apply(
    lambda x: str(x)[:7])
payment_df.tail()

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update,month
16044,16045,599,1,14599,4.99,2005-08-21 17:43:42,2006-02-15 22:24:12,2005-08
16045,16046,599,1,14719,1.99,2005-08-21 21:41:57,2006-02-15 22:24:12,2005-08
16046,16047,599,2,15590,8.99,2005-08-23 06:09:44,2006-02-15 22:24:12,2005-08
16047,16048,599,2,15719,2.99,2005-08-23 11:08:46,2006-02-15 22:24:13,2005-08
16048,16049,599,2,15725,2.99,2005-08-23 11:25:00,2006-02-15 22:24:13,2005-08

In [31]:
payment_df.groupby('month').agg({
        'payment_id' : [np.size],
        'amount' : [np.sum, np.mean],
    })

        payment_id    amount
              size       sum      mean
month
2005-05       1157   4824.43  4.169775
2005-06       2312   9631.88  4.166038
2005-07       6711  28373.89  4.227968
2005-08       5687  24072.13  4.232835
2006-02        182    514.18  2.825165